rheoTool/tutorials/rheoEFoam/ICEO/NernstPlanckCoupled/constant/electricProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      electricProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
parameters
{
        type             NernstPlanckCoupled;      
  
        relPerm          relPerm [ 0 0 0 0 0 0 0 ] 80;  
        T                T [ 0 0 0 1 0 0 0 ] 300;
        psiContrib       true;
        
        species
        (        
           cCation
           {        
              z                 z [ 0 0 0 0 0 0 0 ] 1;      
              D                 D [ 0 2 -1 0 0 0 0 ] 1e-9;          
           }
           
           cAnion
           {  
              z                 z [ 0 0 0 0 0 0 0 ] -1;         
              D                 D [ 0 2 -1 0 0 0 0 ] 1e-9;          
           }               
        ); 
}

// ************************************************************************* //
